read -sv ./tea.v
hierarchy -top tea_enc_dec
#chparam -set swapbytes 0

proc
opt
#opt -full
#opt_expr -full

clean -purge

show -format svg -prefix diagram -stretch
