read -sv ./tea.v
hierarchy -top tea_interface

#proc 
#opt
synth_ice40
write_verilog tea_synth.v
write_blif tea_synth.blif
